#Напишите программу, которая будет преобразовывать десятичное число в двоичное. 
# Подумайте, как это можно решить с помощью рекурсии.
numb = int(input('Введите число: '))
bin_list=[]
def bin_n(numb):
    """_принимает на вход десятичное число, которое необходимо перевести в двоичну систему счисления

    Args:
        numb (int): десятичное число
        bin_list[]: список, в который записыватеся двоичное число
    """
    if numb == 0: return
    bin_n(numb // 2)
    #print(numb % 2)
    bin_list.append(numb % 2)
bin_n(numb)
print(f'В двоичной системе счисления: {bin_list}')